Revit 2026 API
Rebar.CreateFromCurves Method
Overload List
Name | Description
CreateFromCurves(Document, RebarStyle, RebarBarType, Element, XYZ, IList<Curve>, BarTerminationsData, Boolean, Boolean)
CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList<Curve>, RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | Obsolete.
CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList<Curve>, RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId, Boolean, Boolean) | Obsolete.
Top
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace